let diligenceDefinitions = [
    // плохо
    [
        'Не демонструє особливої старанності у навчанні. Треба докладати більше зусиль. ',
        'Не демонструє особливої старанності у навчанні. Потрібно лише трохи більше старання і результати не заставлять себе чекати. ',
    ],
    // отлично
    [
        'Працює старанно та зосереджено на заняттях. ',
        'Показує гарну старанність. ',
    ]
]

let recommendationDefinitions = [
    [
        'Необхідно додатково самостійно опрацьовувати матеріали електронних уроків. ',
        'Труднощі, що виникають з освоєнням нового матеріалу поточної дисципліни можна вирішити, додатково вивчаючи матеріал електронних уроків у майстаті та звертаючись за допомогою до викладача. ',
        'Прогалини у опауванні нових знань можна заповнити за допомогою матеріалу електронних уроків та консультацій з викладачем. ',
    ]
]

// продуктивность на занятиях
let activityDefinitions = [
    // плохо
    [
        'Практичні завдання виконує не в повному обсязі, але це нескладно виправити. Потрібно лише трохи більше старання і все виходитиме. Необхідно додатково самостійно орпацьовувати матеріали електронних уроків. ',
        'Практичні завдання виконує з деякими складнощами, але це можна виправити. Потрібно лише трохи більше старання і все виходитиме. Необхідно додатково самостійно орпацьовувати матеріали електронних уроків. '
    ],
    // хорошо
    [
        'Успішно виконує практичні завдання, хоча є деякі неточності. ',
        'Загалом успішно виконує практичні завдання. ',
        'Демонструє непогані навчальні результати на практичних заняттях, але може ще більше покращити свої досягнення. '
    ],
    // отлично
    [
        'Працює старанно та зосереджено на заняттях. ',
        'Працює відмінно на заняттях. ',
        'Активно бере участь в заняттях та показує ентузіазм. ',
        'З ентузіазмом бере участь в заняттях та виконує практичні завдання. ',
        'Активно бере участь в заняттях та швидко виконує практичні завдання. ',
        'Швидко та якісно виконує практичні завдання на заняттях. ',
        'Показує високу продуктивність під час виконання практичних завдань на заняттях. '
    ]
];

// скорость усвоения материала
let speedDefinitions = [
    // погано
    [
        'Виникають труднощі з освоєнням нового матеріалу поточної дисципліни. ',
        'Є певні складнощі у засвоєнні нового матеріалу поточної дисципліни. '
    ],
    // середньо
    [
        "Засвоєння нового матеріалу є досить успішним, але є незначні прогалини. ",
        "Новий матеріал вивчається зі звичайними труднощами, але їх можна вирішити, працюючи над матеріалом додатково та звертаючись за допомогою до матеріалу електронних уроків у майстаті. ",
        "Опанування нових знань є непоганим в цілому, але є певні прогалини, які можна заповнити за допомогою матеріалу електронних уроків та консультацій з викладачем. ",
        "Нові знання вивчаються добре в цілому, але деякі прогалини потребують додаткового опрацювання матеріалу поточної теми. ",
    ]
    ,
    // відмінно
    [
        "Новий матеріал засвоюється швидко та без проблем. ",
        "Засвоєння нового матеріалу йде на льоту. ",
        "Освоєння нового матеріалу не становить проблем. ",
        "Освоєння матеріалу поточної теми проходить успішно. ",
        "Демонструє високі навчальні досягнення. ",
        "Показує відмінні навчальні результати. "
    ],
];

// креативность
let interestDefinitions = [
    // погано
    [
        'На заняттях великої активності не виявляє. ',
        'Не виявляє особливого інтересу до предмета. ',
        'До вивчення поточної дисципліни підходить без ентузіазму. '
    ],
    // відмінно
    ['Працює творчо. ', 'Демонструє креативний підхід. ']
];

// дисциплина
let behaviorDefinitions = [
    // плохо
    ['Нерідко відволікається на сторонні речі та відволікає розмовами інших. ', 'Є проблеми з дисципліною, над якими потрібно попрацювати. ', 'Є проблеми з дисципліною. Нерідко відволікає інших. ', 'Є проблеми з дисципліною, на які треба звернути увагу. '],
    // хорошо
    ['Поведінка непогана. ', 'Поведінка хороша. ', 'На заняттях поводиться добре. '],
    // отлично
    ['Поведінка відмінна. ', 'Показує зразкову поведінку. ', 'Не відволікається на сторонні речі і не відволікає інших. ']
];

// выполнение домашних заданий
let homeworkDefinitions = [
    // плохо
    ['Відсоток виконання ДЗ залишає бажати кращого. Можна змінити цей відсоток в ліпшу сторону. ', 'Відсоток виконання ДЗ не найкращий. Можна змінити цей відсоток в ліпшу сторону. ', 'Відсоток виконання ДЗ залишає бажати кращого. Можна змінити цей відсоток в ліпшу сторону. Також своєчасне виконання ДЗ покращить засвоєння нового матеріалу. '],
    // так себе
    ['Має низку невиконаних ДЗ. Потрібно не закидати домашню роботу, оскільки вона дуже важлива у навчанні. '],
    // хорошо
    ['ДЗ намагається виконувати вчасно. ', 'ДЗ намагається виконувати вчасно. ', 'Відсоток виконання ДЗ високий. ', 'Відсоток виконання ДЗ високий, але може бути ще вищим. ', 'Виконує більшу частину ДЗ. '],
    // отлично
    ['Виконує всі ДЗ. Потрібно продовжувати так само! ', 'Відсоток виконання ДЗ чудовий. ', 'Відсоток виконання ДЗ відмінний. Так тримати! ']
];